jp-monkeyboard/Bosch-BMP085-Barometer-for-MonkeyBUS-PIC18/Firmware/main.c
#elif defined(__C30__)
    #if defined(PROGRAMMABLE_WITH_USB_HID_BOOTLOADER)
        /*
         *	ISR JUMP TABLE
         *
         *	It is necessary to define jump table as a function because C30 will
         *	not store 24-bit wide values in program memory as variables.
         *
         *	This function should be stored at an address where the goto instructions 
         *	line up with the remapped vectors from the bootloader's linker script.
         *  
         *  For more information about how to remap the interrupt vectors,
         *  please refer to AN1157.  An example is provided below for the T2
         *  interrupt with a bootloader ending at address 0x1400
         */
//        void __attribute__ ((address(0x1404))) ISRTable(){
//        
//        	asm("reset"); //reset instruction to prevent runaway code
//        	asm("goto %0"::"i"(&_T2Interrupt));  //T2Interrupt's address
//        }
    #endif
#endif




/** DECLARATIONS ***************************************************/
#pragma code

/******************************************************************************
 * Function:        void main(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Main program entry point.
 *
 * Note:            None
 *****************************************************************************/
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{   
    InitializeSystem();

    #if defined(USB_INTERRUPT)
        USBDeviceAttach();
    #endif

    while(1)
    {
        #if defined(USB_POLLING)
		// Check bus status and service USB interrupts.
        USBDeviceTasks(); // Interrupt or polling method.  If using polling, must call
        				  // this function periodically.  This function will take care
        				  // of processing and responding to SETUP transactions 
        				  // (such as during the enumeration process when you first
        				  // plug in).  USB hosts require that USB devices should accept
        				  // and process SETUP packets in a timely fashion.  Therefore,
        				  // when using polling, this function should be called 
        				  // regularly (such as once every 1.8ms or faster** [see 
        				  // inline code comments in usb_device.c for explanation when
        				  // "or faster" applies])  In most cases, the USBDeviceTasks() 
        				  // function does not take very long to execute (ex: <100 
        				  // instruction cycles) before it returns.
        #endif
    				  

		// Application-specific tasks.
		// Application related code may be added here, or in the ProcessIO() function.
        ProcessIO();        
		bmp085Convert (&BmpUt, &BmpUp);
		//if (USBUSARTIsTxTrfReady())
			PrintBmpData (BmpUt, BmpUp);
    }//end while
}//end main
/******************************************************************************
 * Function:        void I2CGetBytes (unsigned char address, 
 *					unsigned char bytes, unsigned char *buff)
 *
 * PreCondition:    None
 *
 * Input:           Slave device address, number of bytes to be read,
 *					destination buffer
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine gets the number of bytes and store into the
 *					given buffer.
 *
 * Note:            
 *
 *****************************************************************************/
void I2CGetBytes (unsigned char address, unsigned char bytes, char *buff, char ack)
{
	char i = bytes;
	SendStart();	
	SendByte (address);
	for (i = 0; i < bytes - 1; i++)
	{
		buff[i] = ReceiveByte();
		SendAck();
	}
	buff[bytes - 1] = ReceiveByte();
	if (ack)
	{
		SendAck();
	}
	else
	{
		SendNack();
	}
	SendStop();
}
/******************************************************************************
 * Function:        short bmp085ReadShort (unsigned char address)
 *
 * PreCondition:    None
 *
 * Input:           Device address
 *
 * Output:          A short value
 *
 * Side Effects:    None
 *
 * Overview:        This routine gets the number of bytes and store into the
 *					given buffer.
 *
 * Note:            
 *
 *****************************************************************************/
short bmp085ReadShort (unsigned char address)
{
	short data;
	char i;
	SendStart();
	SendByte (BMP085 << 1);
	SendByte (address);
	SendStop();
	//SendStart();
	I2CGetBytes (((BMP085 << 1) | 0x01), 2, &_buff, 0);
	//SendStop();
	data = _buff[0];
	data = data << 8;
	data |= _buff[1];
	return data;
}

void PrintBmpData (long temperature, long pressure)
{
	char i;
	//if (NextUSBOut)
	//	return;
	NextUSBOut = 0;
	//mLED_2_Off();
	for (i = 0; i < MAXBUFF; i++)
	{
		_buff[i] = 0;
	}
	for (i = 0; i < CDC_DATA_OUT_EP_SIZE; i++)
	{
		USB_Out_Buffer[i] = 0;
	}
	ltoa (pressure, _buff);
	USB_Out_Buffer[NextUSBOut] = 'P';
	NextUSBOut++;
	strcpy (USB_Out_Buffer+NextUSBOut, _buff);
	NextUSBOut = strlen (USB_Out_Buffer);
	USB_Out_Buffer[NextUSBOut] = 'T';
	NextUSBOut ++;
	ltoa (temperature, _buff);
	strcpy (USB_Out_Buffer+NextUSBOut, _buff);	
	NextUSBOut = strlen (USB_Out_Buffer);
	USB_Out_Buffer[NextUSBOut] = '\r';
	NextUSBOut ++;
	USB_Out_Buffer[NextUSBOut] = '\n';
	NextUSBOut ++;
	USB_Out_Buffer[NextUSBOut] = 0;
	NextUSBOut = strlen (USB_Out_Buffer);
	mLED_2_On();
}

void BMP085Calibration (void)
{
	ac1 = bmp085ReadShort(0xAA);
	ac2 = bmp085ReadShort(0xAC);
	ac3 = bmp085ReadShort(0xAE);
	ac4 = bmp085ReadShort(0xB0);
	ac5 = bmp085ReadShort(0xB2);
	ac6 = bmp085ReadShort(0xB4);
	b1 = bmp085ReadShort(0xB6);
	b2 = bmp085ReadShort(0xB8);
	mb = bmp085ReadShort(0xBA);
	mc = bmp085ReadShort(0xBC);
	md = bmp085ReadShort(0xBE);	
}
unsigned short Bmp085ReadUt(void)
{
	unsigned short ut;
	SendStart();
	SendByte (BMP085 << 1);
	SendByte (0xF4);
	SendByte (0x2E);
	SendStop();
	while (!(PORTCbits.RC5));
	ut = (long) bmp085ReadShort (0xF6);
	return ut;
}

unsigned long Bmp085ReadUp(void)
{
	long up = 0;
	unsigned char ossValue;
	SendStart();
	SendByte (BMP085 << 1);
	SendByte (0xF4);
	ossValue = OSS << 6;
	ossValue = 0x34+ossValue;
	SendByte (ossValue);
	SendStop();
	while (!(PORTCbits.RC5));
	SendStart();
	SendByte (BMP085 << 1);
	SendByte (0xF6);
	SendStop();
	I2CGetBytes (((BMP085 << 1) | 0x01), 3, &_buff, 0);
	up = (unsigned long)_buff[0];
	up = up << 8;
	up |= (unsigned long)_buff[1];
	up = up << 8;
	up |= (unsigned long)_buff[2];
	//up &= 0xFFFF00;
	ossValue = 8-OSS;
	up = up >> ossValue;
	//up = up >> 8;
	return up;	
}

void bmp085Convert(long* temperature, long* pressure)
{
	unsigned short ut;
	unsigned long up;
	long x1, x2, b5, b6, x3, b3, p;
	unsigned long b4, b7;
	Delay10KTCYx(200);
	mLED_1_On();
	ut = Bmp085ReadUt();
	up = Bmp085ReadUp();
	//ut = 27898;
	//up = 23843;
	x1 = (((long)ut - (long)ac6) * (long)ac5) / 0x8000;
	x2 = ((long)mc * 0x800) / (x1 + md);
	b5 = x1 + x2;
	*temperature = (b5 + 8) / 0x10;
	//*temperature = ut;
	//*pressure = up;
	//return;
	b6 = b5 - 4000;
	x1 = ((long)b2 * (b6 * b6 / 0x1000)) / 0x800;
	x2 = (long)ac2 * b6 / 0x800;
	x3 = x1 + x2;
	b3 = (((long) ac1) * 4 + x3);
	b3 = b3 << OSS;
	b3 = (b3+2)/0x04;
	//b3 = ((((long) ac1) * 4 + x3) + 2)/ 0x04;
	x1 = (long)ac3 * b6 / 0x2000;
	x2 = (b1 * (b6 * b6 / 0x1000)) / 0x10000;
	x3 = ((x1 + x2) + 2) / 4;
	b4 = ((unsigned long)ac4 * (unsigned long) (x3 + 0x8000)) / 0x8000;
	b7 = ((unsigned long) up - b3);// * (50000);
	b7 = b7 * (50000 >> OSS);
	p = b7 < 0x80000000 ? (b7 * 2) / b4 : (b7 / b4) * 2;
	x1 = (p / 0x100) * (p / 0x100);
	x1 = (x1 * 3038) / 0x10000;
	x2 = (-7357 * p) / 0x10000;
	p = p + ((x1 + x2 + 3791) / 0x10);
	*pressure = p;

	Delay10KTCYx(200);
	//*temperature = 21;
	//*pressure = 100;
	mLED_1_Off();
}
/********************************************************************
 * Function:        static void InitializeSystem(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        InitializeSystem is a centralize initialization
 *                  routine. All required USB initialization routines
 *                  are called from here.
 *
 *                  User application initialization routine should
 *                  also be called from here.                  
 *
 * Note:            None
 *******************************************************************/
static void InitializeSystem(void)
{
    #if (defined(__18CXX) & !defined(PIC18F87J50_PIM))
        ADCON1 |= 0x0F;                 // Default all pins to digital
    #elif defined(__C30__)
    	#if defined(__PIC24FJ256DA210__) || defined(__PIC24FJ256GB210__)
    		ANSA = 0x0000;
    		ANSB = 0x0000;
    		ANSC = 0x0000;
    		ANSD = 0x0000;
    		ANSE = 0x0000;
    		ANSF = 0x0000;
    		ANSG = 0x0000;
       #elif defined(__dsPIC33EP512MU810__) || defined (__PIC24EP512GU810__)
        	ANSELA = 0x0000;
    		ANSELB = 0x0000;
    		ANSELC = 0x0000;
    		ANSELD = 0x0000;
    		ANSELE = 0x0000;
    		ANSELG = 0x0000;
            

        #else
        	AD1PCFGL = 0xFFFF;
        #endif  
    #elif defined(__C32__)
        AD1PCFG = 0xFFFF;
    #endif

    #if defined(PIC18F87J50_PIM) || defined(PIC18F46J50_PIM) || defined(PIC18F47J53_PIM)
	//On the PIC18F87J50 Family of USB microcontrollers, the PLL will not power up and be enabled
	//by default, even if a PLL enabled oscillator configuration is selected (such as HS+PLL).
	//This allows the device to power up at a lower initial operating frequency, which can be
	//advantageous when powered from a source which is not gauranteed to be adequate for 48MHz
	//operation.  On these devices, user firmware needs to manually set the OSCTUNE<PLLEN> bit to
	//power up the PLL.
    {
        unsigned int pll_startup_counter = 600;
        OSCTUNEbits.PLLEN = 1;  //Enable the PLL and wait 2+ms until the PLL locks before enabling USB module
        while(pll_startup_counter--);
    }
    //Device switches over automatically to PLL output after PLL is locked and ready.
    #endif

