jp-monkeyboard/Bosch-BMP085-Barometer-for-MonkeyBUS-PIC18/Firmware/main.c
/******************************************************************************
 * Function:        void WaitSSP(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Waits for SSPIF to clear
 *
 * Note:            
 *
 *****************************************************************************/
void WaitSSP (void)
{
	while(!(PIR1bits.SSPIF));
	PIR1bits.SSPIF = 0;
}

/******************************************************************************
 * Function:        void SendStart(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Sends i2c start bit
 *
 * Note:            
 *
 *****************************************************************************/
void SendStart (void)
{
    SSPCON2bits.SEN=1;
    WaitSSP();
}

/******************************************************************************
 * Function:        void SendRestart(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Sends i2c restart bit
 *
 * Note:            
 *
 *****************************************************************************/
void SendRestart(void)
{
    SSPCON2bits.RSEN=1;
    WaitSSP();
}

/******************************************************************************
 * Function:        void SendStop(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Sends i2c stop bit
 *
 * Note:            
 *
 *****************************************************************************/
void SendStop(void)
{
    SSPCON2bits.PEN=1;
    WaitSSP();
}
/******************************************************************************
 * Function:        void SendByte(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Sends byte to slave and wait for ack
 *
 * Note:            
 *
 *****************************************************************************/
void SendByte(char Byte)
{
    SSPBUF=Byte;
    WaitSSP();
	while (SSPCON2bits.ACKSTAT);
}

/******************************************************************************
 * Function:        unsigned char ReceiveByte(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          Byte from slave device
 *
 * Side Effects:    None
 *
 * Overview:        Gets byte from slave device
 *
 * Note:            
 *
 *****************************************************************************/
char ReceiveByte(void)
{
    SSPCON2bits.RCEN=1;
    WaitSSP();
    return(SSPBUF);
}

/******************************************************************************
 * Function:        void SendNack(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Sends nack to slave device
 *
 * Note:            
 *
 *****************************************************************************/
void SendNack(void)
{
    SSPCON2bits.ACKDT=1;
    SSPCON2bits.ACKEN=1;
    WaitSSP();
}

/******************************************************************************
 * Function:        void SendAck(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Sends ack to slave device
 *
 * Note:            
 *
 *****************************************************************************/
void SendAck(void)
{
    SSPCON2bits.ACKDT=0;
    SSPCON2bits.ACKEN=1;
    WaitSSP();
}

/******************************************************************************
 * Function:        void UserInit(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine should take care of all of the demo code
 *                  initialization that is required.
 *
 * Note:            
 *
 *****************************************************************************/
void UserInit(void)
{
	unsigned char i;
    InitializeUSART();

// 	 Initialize the arrays
	for (i=0; i<sizeof(USB_Out_Buffer); i++)
    {
		USB_Out_Buffer[i] = 0;
    }

	NextUSBOut = 0;
	LastRS232Out = 0;
	lastTransmission = 0;

	mInitAllLEDs();

	//Initialising I2C
	InitializeI2C();
	BMP085Calibration();
	ANSEL = 0;
	TRISCbits.RC5 = 1;

}//end UserInit

/******************************************************************************
 * Function:        void InitializeUSART(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine initializes the UART to 19200
 *
 * Note:            
 *
 *****************************************************************************/
void InitializeUSART(void)
{
    #if defined(__18CXX)
	    unsigned char c;
        #if defined(__18F14K50)
    	    //ANSELHbits.ANS11 = 0;	// Make RB5 digital so USART can use pin for Rx
            ANSELH = 0;
            #ifndef BAUDCON
                #define BAUDCON BAUDCTL
            #endif
        #endif
        UART_TRISRx=1;				// RX
        UART_TRISTx=0;				// TX
        TXSTA = 0x24;       	// TX enable BRGH=1
        RCSTA = 0x90;       	// Single Character RX
        SPBRG = 0x71;
        SPBRGH = 0x02;      	// 0x0271 for 48MHz -> 19200 baud
        BAUDCON = 0x08;     	// BRG16 = 1
        c = RCREG;				// read 
    #endif

    #if defined(__C30__)
        #if defined( __PIC24FJ256GB110__ ) || defined( PIC24FJ256GB210_PIM )
            // PPS - Configure U2RX - put on pin 49 (RP10)
            RPINR19bits.U2RXR = 10;

            // PPS - Configure U2TX - put on pin 50 (RP17)
            RPOR8bits.RP17R = 5;
        #elif defined(__PIC24FJ64GB004__)
            // PPS - Configure U2RX - put on RC3/pin 36 (RP19)
            RPINR19bits.U2RXR = 19;

